{
  "data": [
    {
      "name": "الأحد",
      "mean": "المنفرد ليس معه غيره",
      "details": "الواحد الأحد ليس لقدرته حد ولا لعظمته مثيل"
    },
    {
      "name": "البارئ",
      "mean": "الخالق لما فيه روح",
      "details": "أوجد الله الكون بقدرته العظيمة لنجد في كل ما يحيط بنا قدرته وإعجازه في خلق الكون"
    },
    {
      "name": "الباسط",
      "mean": "موسع الرزق والعلم وموسع ما شاء من كونه ومخلوقاته ورحمته",
      "details": "يبسط لك الرزق من حيثُ لا يخطر لك إن كنت مؤمناً تسير في طريق الخير"
    },
    {
      "name": "الباعث",
      "mean": "باعث الرسل إلى الناس وباعث الموتى من القبور وباعث الحياة كلها",
      "details": "سبحانه القادر على بعث أرواح العباد بعد موتهم ومحاسباتهم على أفعالهم في الدنيا"
    },
    {
      "name": "الباقي",
      "mean": "لا يناله تغير ولا تبدل ولا زوال",
      "details": "الكون والمخلوقات وكل الحياة إلى فناء إلا الله عز وجل فوحده باق إلى ما لا نهاية"
    },
    {
      "name": "البديع",
      "mean": "خالق مبدع جميل رائع محدث عجيب",
      "details": "سبحان من أبدع في خلق الكون فصوره في احسن الأشكال ولا يُمكن أن يأتي بمثله أحداً سواه"
    },
    {
      "name": "البر",
      "mean": "كثير العطايا والإحسان",
      "details": "القادر على نصرة المظلوم وشفاء المريض من عباده فلا بار سواه"
    },
    {
      "name": "البصير",
      "mean": "المبصر العالم الخبير من أسمائه تعالى",
      "details": "عالم بكل ما يحدث في الكون مهما كان ضئيلاً"
    },
    {
      "name": "التواب",
      "mean": "يقبل توبة عباده",
      "details": "وحده سبحانه من ينعم على عباده بالتوبة عن الأخطاء والذنوب"
    },
    {
      "name": "الجامع",
      "mean": "يجمع شتات الحقائق والخلائق في الدنيا والآخرة",
      "details": "وحده جامع البشر لموعد لا ريب فيه يوم القيامة لمحاسبتهم على أعمالهم في الحياة"
    },
    {
      "name": "الغني",
      "mean": "المستغني بذاته عن سواه من الخلق وكل الوجود مفتقر إليه",
      "details": "الغني عن كل حاجة وكل شأن فلا غني سواه ولا مثيل له في الفضل والنعم"
    },
    {
      "name": "المغني",
      "mean": "المتفضل بإغناء سواه",
      "details": "يُغني عباده عن سؤال غيره فيعطيهم من فضله خيراً مما تمنوا"
    },
    {
      "name": "المانع",
      "mean": "يمنع أسباب الهلاك ويمنع ما شاء وعمن يشاء",
      "details": "يمنع شر الأقدار ومصائبها عن عباده رحمةً بهم"
    },
    {
      "name": "الضار",
      "mean": "ينزل غضبه على من عصاه",
      "details": "سبحانه ليس بضار إلا بمن أفسد في أرضه وأضر مخلوقاته"
    },
    {
      "name": "النافع",
      "mean": "يعم خيره كل الوجود",
      "details": "ينعم الله على عباده بالنفع والخير في كل حين، فيهديهم إلى صواب أمورهم والخير في الدنيا"
    },
    {
      "name": "الجبار",
      "mean": "المنفذ لأمره دون اعتراض",
      "details": "يجبر المظلوم ويرد إليه حقه من الظالم الذي يُقهر بقوة الله جزاء ظلمه"
    },
    {
      "name": "الجليل",
      "mean": "له صفات الجلال سبحانه وتعالي",
      "details": "سبحانه ذو الجلال والإكرام لا يماثله شيء في عظمته"
    },
    {
      "name": "الحسيب",
      "mean": "يكفي عباده ويحاسبهم",
      "details": "يُدبر شؤون عباده وهم في بطون أمهاتهم، فلا خاب من جعل الله حسيباً له"
    },
    {
      "name": "الحفيظ",
      "mean": "يحفظ عباده وكونه من الخلل والاضطراب ويحفظ أعمال العباد للحساب",
      "details": "يحفظ سيّر الحياة في الأكوان بقدرته"
    },
    {
      "name": "الحق",
      "mean": "هو الحق بذاته وأمره حق",
      "details": "رب الكون أوجد الحق والعدل بداخله وجعله ميزان الأمور ونصابها السليم"
    },
    {
      "name": "الحكم",
      "mean": "الحاكم الذي لا راد لقضائه ولا معقب لحكمه الحكم من يفصل بين المتنازعين ويحكم في الأمور وبين الناس",
      "details": "يحكم بالعدل بين عباده ويرد الحقوق إلى أصحابها"
    },
    {
      "name": "الحكيم",
      "mean": "المدبر بحكمة عليا",
      "details": "سبحانه واضع أمور الكون في نصابها الصحيح وتوازن لا يُمكن أن يُخطا أبدا"
    },
    {
      "name": "الحليم",
      "mean": "الصفوح الستير ذو الحلم",
      "details": "حليم على عباده يمنحهم الفرصة للتوبة والرجوع إلى طريق الحق"
    },
    {
      "name": "الحميد",
      "mean": "المحمود بذاته",
      "details": "الله لا يُحمد سواه على الخير والسوء مهما بلغ، فلا كريم بالنعم والخيرات على الإنسان غير الخالق العظيم جل شأنه"
    },
    {
      "name": "الحي",
      "mean": "له الحياة الكاملة والدائمة والذاتية",
      "details": "الكون والمخلوقات إلى فناء مهما طال وجودها في الدنيا عدا الله عز وجل الحي الذي لا يموت"
    },
    {
      "name": "الخافض",
      "mean": "يخفض من يستحق الخفض",
      "details": "قادر على خسف الأرض بالظالمين والعاصيين جزاء كفرهم بقدرة الله"
    },
    {
      "name": "الرافع",
      "mean": "يرفع من يستحق من عباده وما شاء من كونه",
      "details": "يرفع المؤمنين من عباده إلى أعلى درجات الجنة"
    },
    {
      "name": "الخالق",
      "mean": "الموجد للمخلوقات",
      "details": "فاطر الكون والسموات وكافة المخلوقات به، فلا يوجد خالق سواه"
    },
    {
      "name": "الخبير",
      "mean": "العليم ذو الخبرة التامة العالم بكنه الأشياء وحقائقها",
      "details": "لا يحدث خبر في السموات والأرض إلا وكان خبيراً به قبل حدوثه، فسبحانه يقول للشيء كن فيكون"
    },
    {
      "name": "الرؤوف",
      "mean": "عظيم الرأفة والرحمة",
      "details": "رحيم رؤوف بالعباد أينما كانوا ووقتما دعوه بقلب صادق"
    },
    {
      "name": "الرحمن",
      "mean": "المنعم بجلائل النعم",
      "details": "تشمل رحمة الله كافة مخلوقاته على الأرض فلا رحمن رحيم سواه"
    },
    {
      "name": "الرحيم",
      "mean": "المنعم بدقائق النعم",
      "details": "مهما بلغت قسوة الحياة تجد رحمة الله تدركك أينما كنت، فلا رحمن راحم بالعباد سوى خالقهم الرحيم"
    },
    {
      "name": "الرزاق",
      "mean": "خالق الرزق وأسباب الرزق ومقدر الأرزاق",
      "details": "يرزق خلقه جميعاً القدرة على الحياة حتى الطيور في أعشاشها"
    },
    {
      "name": "الوارث",
      "mean": "الباقي بعد فناء الموجودات",
      "details": "سبحانه الباقي من سيرث الأرض ومن عليها، فليس بباق سواه"
    },
    {
      "name": "الرشيد",
      "mean": "المرشد لعباده",
      "details": "سبحانه من يُضيء نور الهداية في قلوب عباده ويرشدهم إلى طريق الخير"
    },
    {
      "name": "الصبور",
      "mean": "لا يتعجل بالعقوبة وكل شيء عنده بحكمة ومقدار",
      "details": "الله عز وجل صبور على المخطئين من عباده مهما طالت أخطائهم فيمنحهم فرص عديدة للتوبة والعودة إلى طريق الحق"
    },
    {
      "name": "الرقيب",
      "mean": "يراقب كل صغيرة وكبيرة ولا يغيب عنه شيء مهما دق",
      "details": "يدور الكون بمراقبته ولا يغفل عن شيء مهما كان صغيراً"
    },
    {
      "name": "السلام",
      "mean": "الأمان لخلقه وواهب السلام لعباده",
      "details": "أحل رب العالمين السلام على الكون ومخلوقاته، فمنه السلام وإليه السلام ربنا ذو الجلال والإكرام"
    },
    {
      "name": "السميع",
      "mean": "المسمع والسامع وهو للمبالغة يسمع تعالى كل الأصوات والكلمات ويستجيب لعبيده",
      "details": "سامع لدعوة عباده في الأرض ليُجيب دعوات عباده المؤمنين ويمنحهم خيراً مما سألوا"
    },
    {
      "name": "الشكور",
      "mean": "يعطي الكثير على القليل",
      "details": "يهب الله للطائعين من عباده شكراً على أعمالهم الصالحة بأن يمنحهم الحسنات ودخول الجنة"
    },
    {
      "name": "الشهيد",
      "mean": "العالم بكل مخلوق",
      "details": "سبحانه شاهداً على أمور الكون وما يجرى بداخله، ولا يُمكن أن يغيب عن علمه شيئاً مهما صغر حجمه"
    },
    {
      "name": "الصمد",
      "mean": "يقصد وحده",
      "details": "المولى عز وجل الأحد الصمد، لم يلد ولم يولد ولا يوجد له كفؤاً أحد"
    },
    {
      "name": "الظاهر",
      "mean": "أظهر وجوده بآياته",
      "details": "العالم بظواهر الأمور وإن غابت عن أعين البشر"
    },
    {
      "name": "الباطن",
      "mean": "لا يعلم أحد ذاته",
      "details": "لا يعلم بخفايا الأمور وثناياها سواه عز وجل، فيخفي القدر والمستقبل عن البشر لحكمة يعلمها وحده جل شأنه"
    },
    {
      "name": "العدل",
      "mean": "العادل الكامل في عدالته",
      "details": "لا يقبل بأن يسود الظلم في الكون أبدا، بل يعط لكل ذي حق حقه"
    },
    {
      "name": "العزيز",
      "mean": "الغالب",
      "details": "سبحانه تعالى وتنزه عن كل عيب أو سوء"
    },
    {
      "name": "العظيم",
      "mean": "البالغ أقصى مراتب العظمة والجلال والكمال",
      "details": "سبحانه الواحد الأحد جمع كل الصفات الإلهية في صفته العظيم"
    },
    {
      "name": "العفو",
      "mean": "يمحو سيئات من يستغفره",
      "details": "ذو القدرة على العفو عن العباد والصفح عن ذنوبهم، فما من أحد طلب العفو من ربه بنية صادقة إلا وعفا عنه وبدّل كل سيئاته حسنات"
    },
    {
      "name": "العلي",
      "mean": "المتعال ولا يدركه أحد",
      "details": "سبحانه تعالى وتنزه عن كل شيء"
    },
    {
      "name": "العليم",
      "mean": "العالم بكل شيء ولا يغيب عنه شيء",
      "details": "يعلم بكافة شئون الكون مهما صغرت أو عظُمت، ويدرى ما تخبئه نفس الإنسان في داخلها"
    },
    {
      "name": "الغفار",
      "mean": "كثير المغفرة وستر الذنوب",
      "details": "يغفر الله للتائبين من عباده ذنوبهم حتى وإن كانت مثل زبدّ البحر"
    },
    {
      "name": "الغفور",
      "mean": "كثير الغفران",
      "details": "يغفر لعباده ذنوبهم وإن بلغت الجبال إن رجعوا إلى طريق الحق والتوبة"
    },
    {
      "name": "الفتاح",
      "mean": "الذي يفتح خزائن رحمته لعباده",
      "details": "يفتح قلوب عباده للطاعة والإيمان، ويُفرج عنهم كل ضيق وحزن"
    },
    {
      "name": "القابض",
      "mean": "قابض الأرواح والأرزاق والقابض على السماوات والأرض والكون",
      "details": "يقبض الخير عن العاصيين ويُريهم في الدنيا جزاء جحودهم بنعم الله عليهم"
    },
    {
      "name": "القادر",
      "mean": "القوي القادر علي كل شئ سبحانه وتعالي",
      "details": "وحده القادر على فعل ما يشاء في أي زمان وأي مكان"
    },
    {
      "name": "المقتدر",
      "mean": "المتمكن من الشيء",
      "details": "صاحب القدرة غير المحدودة على فعل ما يريد أينما يريد"
    },
    {
      "name": "القدوس",
      "mean": "المتعالي عن كل النقائص",
      "details": "تقدست الذات الإلهية لله عز وجل عن أي نقص أو عيب"
    },
    {
      "name": "القهار",
      "mean": "القابض على كل شيء والقاهر لكل الخلائق",
      "details": "قاهر الظالمين لظلمهم واستبدادهم في الدنيا والآخرة"
    },
    {
      "name": "القوي",
      "mean": "بذاته ولا يحتاج إلى سواه",
      "details": "الله ذو القوة والقدرة على كل شيء فلا يصعب عليه شيء"
    },
    {
      "name": "القيوم",
      "mean": "القائم بنفسه والمقيم لشؤون عباده",
      "details": "قائماً بذاته قبل الخلق جميعاً فهو الله عز وجل لن يفنى أو ينتهي أبداً"
    },
    {
      "name": "الكبير",
      "mean": "لا تستطيع الحواس والعقول إدراكه",
      "details": "يصغُر أي شيء عند مقارنته برب السموات والأرض"
    },
    {
      "name": "الكريم",
      "mean": "يعطي من غير سؤال أو بديل",
      "details": "يكرم عباده حتى وإن عَصّوه حتى يعودوا لطريق الخير والصلاح"
    },
    {
      "name": "اللطيف",
      "mean": "العالم بخفايا الأمور ودقائقها البر بعباده المحسن إليهم",
      "details": "وحده لطيف بعباده ويُخفف عنهم شر المصائب والمحن"
    },
    {
      "name": "الله",
      "mean": "علم على الذات الإلهية المقدسة",
      "details": "علم دال على صفة رب العالمين والذات الإلهية"
    },
    {
      "name": "المؤمن",
      "mean": "المؤمِّن لخلقه من العذاب والخوف",
      "details": "منح الله البشر حب الإيمان وزرعه في نفوسهم، فخلقهم على الفطرة الطيبة المؤمن"
    },
    {
      "name": "المبدئ",
      "mean": "الخالق",
      "details": "الخالق العظيم من بدأ الكون وأوجد به الحياة والمخلوقات جميعاً"
    },
    {
      "name": "المعيد",
      "mean": "يعيد الخلق والحياة",
      "details": "الخالق الباعث وحده القادر على إعادة الروح للإنسان بعد الموت يوم القيامة ليحاسبه على أعماله في الدنيا خيراً وشراً"
    },
    {
      "name": "المتكبر",
      "mean": "المنفرد بذاته بالعظمة",
      "details": "سبحانه تعالى عن كل شيء، فليس لنا رب سواه ولا يماثله أي شيء."
    },
    {
      "name": "المتين",
      "mean": "لا يغلب ولا يقهر",
      "details": "القوي ذو المتانة والصلابة لا يقدر على شيء سواه"
    },
    {
      "name": "المجيب",
      "mean": "يستجيب دعاء عباده",
      "details": "يُجيب الدعاء حتى وإن قاله العبد في ثنايا روحه بنية صادقة"
    },
    {
      "name": "المجيد",
      "mean": "له المجد الأعلى كله",
      "details": "سبحانه تمجدت أسماؤه وصفاته العليا في السموات والأرض"
    },
    {
      "name": "المحصي",
      "mean": "لا يغيب عنه شيء",
      "details": "سبحانه أحصى كل شيء في الكون، فوحده عليم بكل ما يوجد في الكون كأعداد النجوم في السماء وحبات الرمال في الأرض"
    },
    {
      "name": "المحيي",
      "mean": "خالق الحياة في كل حي",
      "details": "من نفخ بالروح في كل الكائنات لتحيا في الدنيا"
    },
    {
      "name": "المميت",
      "mean": "سالب الحياة من الأحياء",
      "details": "سبحانه القادر على أخذ الروح ووفاة العباد في موت مُحدد من قبل خلقهم"
    },
    {
      "name": "المدبر",
      "mean": "يقضي أمر ملكه ويدبر الكائنات",
      "details": ""
    },
    {
      "name": "المعز",
      "mean": "يُعِزّ من استمسك بدينه",
      "details": "يُكرم الله ويُعز المؤمنين الصالحين في الدنيا"
    },
    {
      "name": "المذل",
      "mean": "يُذِلّ أعداءه وعُصاته",
      "details": "وحده قادر على إذلال الظالمين والكافرين بوجوده وما حمله أنبياءه ورسله من رسالات سماوية"
    },
    {
      "name": "المصور",
      "mean": "المعطي كل شيء صورة تميزه",
      "details": "صوّر الله الكون وأوجده في شكل بديع، وجعل لكل كائن بداخله فائدة فسبحانه لم يخلق شيئاً دون جدوى"
    },
    {
      "name": "المقدم",
      "mean": "يقدر الأشياء والأوامر فيقدم بعضها على بعض وفق حكمته",
      "details": "وحده مالك القدرة على تقديم أقدار ومصائر عباده بيده"
    },
    {
      "name": "المؤخر",
      "mean": "الذي يؤخر الثواب والعقاب والأجل إلى وقت معلوم عنده",
      "details": "لا يقدر سواه على تأخير مصائر عباده وفقاً لحكمه يعلمها وحده عز وجل"
    },
    {
      "name": "الأول",
      "mean": "لا شيء قبله ووجوده سبحانه ذاتي",
      "details": "الأول الوحيد من أوجد كل شيء في الكون ولا يُمكن أن يسبقه أحد"
    },
    {
      "name": "الآخر",
      "mean": "هو الباقي بعد فناء الخلق والذي يرجع إليه كل شيء",
      "details": "الله دائم الوجود إلا مالا نهاية فالعالم كله إلى فناء عدا الله عز وجل فلا نهاية لوجوده"
    },
    {
      "name": "المقسط",
      "mean": "يعطي كل ذي حق حقه",
      "details": "ينشر العدل والرحمة بقدرته في الدنيا، فهو العدل الحق"
    },
    {
      "name": "المقيت",
      "mean": "يكفل خلقه بالبقاء والنماء",
      "details": "يسير الكون كل شيء في توقيت محدد بقدرته جل تعالى"
    },
    {
      "name": "الملك",
      "mean": "المتصرف بملكه كيف يشاء",
      "details": "مالك الأرض ومن عليها، خالق الأكوان والسموات، بيده مصائر الخلق وكافة أمورهم في الدنيا والآخرة"
    },
    {
      "name": "المنتقم",
      "mean": "المعاقب لمن يستحق العقوبة",
      "details": "القادر المنتقم القادر على رد الحق لأصحابه والانتقام من الظالمين"
    },
    {
      "name": "المهيمن",
      "mean": "المسيطر",
      "details": "المُسيطر على الكون وأرجاءه ولا يغفل عما يُفعل في أي وقت وأي مكان"
    },
    {
      "name": "النور",
      "mean": "الظاهر بنفسه والمظهر لغيره",
      "details": "الله نور السموات والأرض من يُنعم على عباده الصالحين بنور الهداية والتُقى"
    },
    {
      "name": "الهادي",
      "mean": "يهدي إليه عباده ويهدي كل مخلوق إلى أسباب بقائه وطريق حياته",
      "details": "الرحمن الرحيم من يهدي عباده إلى الخير ويُبعدهم عن كل سوء"
    },
    {
      "name": "الواجد",
      "mean": "لا يحتاج لعون فكل ما يريده يكون",
      "details": "سبحانه واجد الأرض والسموات والكون وما يحويه من أشكال الحياة"
    },
    {
      "name": "الماجد",
      "mean": "له المجد والكبرياء",
      "details": "سبحانه تُمجده مخلوقاته ويسبحون باسمه في السموات والأرض"
    },
    {
      "name": "الواحد",
      "mean": "المنفرد الذي لا نظير له",
      "details": "رب العالمين، رب السموات والأرض الواحد من لا مثيل له"
    },
    {
      "name": "الواسع",
      "mean": "عمت رحمته كل شيء ووسع علمه كل شيء",
      "details": "يسع علمه وقدرته كل ما في الكون"
    },
    {
      "name": "الوالي",
      "mean": "يتابع الأشياء ويناصر من يشاء",
      "details": "قادر على تولي أمور العباد وتدبير أرزاقها، فما من دابة إلا وكتب الله لها رزقها"
    },
    {
      "name": "المتعالي",
      "mean": "المنزه عن مشابهة خلقه",
      "details": "تعالى جل شأنه عن كل نقص أو عيب"
    },
    {
      "name": "الودود",
      "mean": "المحسن لعباده",
      "details": "لطيف بعباده لا يرد سائلاً أتاه أبدا"
    },
    {
      "name": "الوكيل",
      "mean": "القائم بأمور عباده وبكل ما يحتاجون",
      "details": "من يتوكل على الله فهو حسبه، فلا يُمكن أن يُصرف أمور العباد وشؤونهم سواه عز وجل"
    },
    {
      "name": "الولي",
      "mean": "يتولى أمر خلقه بالرعاية",
      "details": "يُدبر المولى عز وجل شؤون عباده ويُصرف أمورهم"
    },
    {
      "name": "الوهاب",
      "mean": "كثير النعم دائم العطايا",
      "details": "جميع النعم لخلقه في الأرض من حيثُ لا يخطر على بال بشر"
    },
    {
      "name": "مالك الملك",
      "mean": "هو المتصرف فى ملكه كيف يشاء ولا راد لحكمه ، ولا معقب لأمره",
      "details": "وحده مالك الكون والحياة والمخلوقات جميعها"
    },
    {
      "name": "ذو الجلال والإكرام",
      "mean": "له الكمال والجلال والإنعام",
      "details": "وحده تجلت أسماؤه في السموات والأرض ويُسبح الكون كله بحمده وفضله"
    }
  ]
}